#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

      + name                = "Client ID"
      + realm_id            = "moh_applications"
      + session_note        = "clientId"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-SERVICE.keycloak_openid_user_session_note_protocol_mapper.Client-IP-Address will be created
  + resource "keycloak_openid_user_session_note_protocol_mapper" "Client-IP-Address" {
      + add_to_access_token = true
      + add_to_id_token     = true
      + claim_name          = "clientAddress"
      + claim_value_type    = "String"
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + name                = "Client IP Address"
      + realm_id            = "moh_applications"
      + session_note        = "clientAddress"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-WEBAPP.keycloak_openid_client.CLIENT will be created
  + resource "keycloak_openid_client" "CLIENT" {
      + access_type                               = "PUBLIC"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "DMFT-WEBAPP"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + description                               = "Driver Medical Fitness Transformation"
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = false
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "DMFT"
      + oauth2_device_authorization_grant_enabled = false
      + pkce_code_challenge_method                = "S256"
      + realm_id                                  = "moh_applications"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = false
      + standard_flow_enabled                     = true
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
      + valid_redirect_uris                       = [
          + "*",
        ]
      + web_origins                               = [
          + "*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-SERVICE.module.service-account-roles.keycloak_openid_client_service_account_realm_role.ROLE["default-roles-moh_applications"] will be created
  + resource "keycloak_openid_client_service_account_realm_role" "ROLE" {
      + id                      = (known after apply)
      + realm_id                = "moh_applications"
      + role                    = "default-roles-moh_applications"
      + service_account_user_id = (known after apply)
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-WEBAPP.module.client-roles.keycloak_role.ROLES["ROLE_NAME_TBD"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + name      = "ROLE_NAME_TBD"
      + realm_id  = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/MOA"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "6167c7e5-aa86-4e6f-ba05-ecb9bb2aa7e8"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.DMFT-WEBAPP.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["LICENCE-STATUS/PRACTITIONER"] will be created
  + resource "keycloak_generic_client_role_mapper" "SCOPE-MAPPING" {
      + client_id = (known after apply)
      + id        = (known after apply)
      + realm_id  = "moh_applications"
      + role_id   = "d6669b04-2962-4bb3-ad33-5b92a3d784df"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.USER-MANAGEMENT-SERVICE.module.client-roles.keycloak_role.ROLES["view-client-dmft-webapp"] will be created
  + resource "keycloak_role" "ROLES" {
      + client_id = "ab6e0d99-9205-4625-8ea4-88835ddd36ae"
      + id        = (known after apply)
      + name      = "view-client-dmft-webapp"
      + realm_id  = "moh_applications"
    }

Plan: 10 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*